src/cf/Reports/уатПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатПлатежныйКалендарь</Name>
			<Comment>Платежный календарь (уат)</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/AccumulationRegisters/уатРасчетыПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатРасчетыПоДокументам</Name>
			<Comment>Расчеты по документам (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Comment>Сумма увеличения долга в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПриходУпр</Name>
					<Comment>Сумма увеличения долга в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Comment>Сумма уменьшения долга в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходУпр</Name>
					<Comment>Сумма уменьшения долга в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Comment>Этап по графику оплаты из договора</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатТекущееСостояниеОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатТекущееСостояниеОплаты</Name>
			<Comment>Текущее состояние оплаты (уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Текущее состояние оплаты по заказу</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияВыполненияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОплаты</Name>
					<Comment>Процент оплачено по платежному календарю от общей суммы услуг в валюте заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачено</Name>
					<Comment>Сумма оплачено по платежному календарю в валюте заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВсего</Name>
					<Comment>Общая сумма услуг по заказу в валюте заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатыНедостаточно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатДатыПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатДатыПлатежей</Name>
			<Comment>Даты платежей (уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПлатежаПредварительная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Дата платежа, включает дни отсрочки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежаУпр</Name>
					<Comment>Сумма платежа в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Comment>Этап по графику оплаты из договора</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВариантыОтсчетаДатыПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыОтсчетаДатыПлатежа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоОтправленияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеОтправленияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоПрибытияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеПрибытияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеДоставкиГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеОтправкиКомплектаСопроводительныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеПолученияСопроводительныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеДатыДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеДатыОказанияУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеВыполненияРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяДата</Name>
					<Comment>Используется при указании даты платежа в накладных вручную (закладка Дополнительно)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПолучателиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПолучателиУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/уатПлатежныйКалендарь/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	ВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ВалютаУпрУчета;
	КонецЕсли;
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		ДатаНач = НачалоНедели(ТекущаяДата());
		ДатаКон = КонецНедели(ТекущаяДата());
	Иначе
		ДатаНач = НачалоПолугодияДоп(ТекущаяДата());
		ДатаКон = КонецПолугодияДоп(ТекущаяДата());
	КонецЕсли;
	
	Если ТребуетсяВыполнитьОтложенноеОбновление_1_1_24_1() Тогда
		Оповещ = Новый ОписаниеОповещения("ТребуетсяВыполнитьОтложенноеОбновление_1_1_24_1_Завершение", ЭтотОбъект);
		ТекстВопроса = "За период текущего года обнаружены данные платежного календаря, для которых рекомендуется выполнить обновление. Открыть обработку обновления?";
		ПоказатьВопрос(Оповещ, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТребуетсяВыполнитьОтложенноеОбновление_1_1_24_1()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	уатРасчетыПоДокументамОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.уатРасчетыПоДокументам.Обороты(&НачДата, , Регистратор, ) КАК уатРасчетыПоДокументамОбороты
	|ГДЕ
	|	(уатРасчетыПоДокументамОбороты.СуммаПриходОборот < 0
	|			ИЛИ уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот < 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	уатЗаказГрузоотправителя.Ссылка
	|ИЗ
	|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатТекущееСостояниеОплаты КАК уатТекущееСостояниеОплаты
	|		ПО уатЗаказГрузоотправителя.Ссылка = уатТекущееСостояниеОплаты.Документ
	|ГДЕ
	|	уатТекущееСостояниеОплаты.Документ ЕСТЬ NULL
	|	И (уатЗаказГрузоотправителя.Дата >= &НачДата)
	|	И уатЗаказГрузоотправителя.Проведен
	|	И (уатЗаказГрузоотправителя.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|	ИЛИ уатЗаказГрузоотправителя.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|	ИЛИ уатЗаказГрузоотправителя.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС))");
	Запрос.УстановитьПараметр("НачДата", НачалоГода(ТекущаяДата()));
	Рез = НЕ Запрос.Выполнить().Пустой();
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ТребуетсяВыполнитьОтложенноеОбновление_1_1_24_1_Завершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ОткрытьФорму("Обработка.уатОтложенноеОбновлениеИБ.Форма.Форма");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Оповещ = Новый ОписаниеОповещения("ТабДокРасшифровка", ЭтотОбъект);
		списокРасшифровка = Новый СписокЗначений;
		списокРасшифровка.Добавить(Расшифровка, "Открыть документ");
		списокРасшифровка.Добавить(Расшифровка, "Открыть отчет ""Контроль отсрочки платежей""");
		ПоказатьВыборИзМеню(Оповещ, списокРасшифровка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокРасшифровка(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Представление = "Открыть документ" Тогда
		ПоказатьЗначение(Неопределено, Результат.Значение.Сделка);
	Иначе
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Отбор",                   Новый Структура("Сделка, ДоговорКонтрагента", Результат.Значение.Сделка, Результат.Значение.Договор));
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ОткрытьФорму("Отчет.уатКонтрольОтсрочкиПлатежей.Форма", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ДатаНач = НачалоМесяца(ДатаНач);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ДатаКон = КонецМесяца(ДатаКон);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	//Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
	//	ДатаНач = НачалоНедели(ТекущаяДата());
	//	ДатаКон = КонецНедели(ТекущаяДата());
	//Иначе
	//	ДатаНач = НачалоПолугодияДоп(ТекущаяДата());
	//	ДатаКон = КонецПолугодияДоп(ТекущаяДата());
	//КонецЕсли;
	
	СформироватьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадоженностиПриИзменении(Элемент)
	СформироватьОтчетСервер();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	// проверка даты начала и окончания периода
	Если ДатаНач = '00010101' ИЛИ ДатаКон = '00010101' ИЛИ ДатаНач > ДатаКон Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период не указан или указан некорректно");
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДатаНач = Результат.ДатаНачала;
		ДатаКон = Результат.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетСервер()
	ПериодичностьДень = (Периодичность = Перечисления.Периодичность.День);
	// В каждой строке минимум 3 ячейки под документы. Если их меньше 3, то все равно отображается 3.
	// Если больше, то просто не отображаются
	СтрокДокументовЗаДеньМинимум = 3;
	КоличПоГоризонтали = ?(ПериодичностьДень, 7, 6); //7 - для вида "День", 6 - для вида "Месяц"
		
	ТабДок.Очистить();
	
	//Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	Макет = Отчеты.уатПлатежныйКалендарь.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРасчетыПоДокументамОбороты.Сделка КАК Сделка,
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатРасчетыПоДокументамОбороты.ПолучательУслуг КАК ПолучательУслуг,
	|	уатРасчетыПоДокументамОбороты.ЭтапОплаты КАК ЭтапОплаты,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС КАК ЗаказНаТС,
	|	ВЫБОР
	|		КОГДА &ВВалютеУпр = ИСТИНА
	|			ТОГДА СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА уатРасчетыПоДокументамОбороты.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|							ТОГДА уатРасчетыПоДокументамОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|						ИНАЧЕ уатРасчетыПоДокументамОбороты.Валюта
	|					КОНЕЦ = &Валюта
	|					ТОГДА СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходОборот)
	|				ИНАЧЕ СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот) * &КоэффициентКурсаУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА &ВВалютеУпр = ИСТИНА
	|			ТОГДА СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот) - СУММА(уатРасчетыПоДокументамОбороты.СуммаРасходУпрОборот)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА уатРасчетыПоДокументамОбороты.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|							ТОГДА уатРасчетыПоДокументамОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|						ИНАЧЕ уатРасчетыПоДокументамОбороты.Валюта
	|					КОНЕЦ = &Валюта
	|					ТОГДА СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходОборот) - СУММА(уатРасчетыПоДокументамОбороты.СуммаРасходОборот)
	|				ИНАЧЕ (СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот) - СУММА(уатРасчетыПоДокументамОбороты.СуммаРасходУпрОборот)) * &КоэффициентКурсаУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК Осталось
	|ПОМЕСТИТЬ уатРасчетыПоДокументамОбороты
	|ИЗ
	|	РегистрНакопления.уатРасчетыПоДокументам.Обороты(
	|			,
	|			,
	|			,
	|			ПолучательУслуг = &ПолучательУслуг
	|				И (&Организация = НЕОПРЕДЕЛЕНО
	|					ИЛИ Организация = &Организация)
	|				И (&Контрагент = НЕОПРЕДЕЛЕНО
	|					ИЛИ Контрагент = &Контрагент)
	|				И (&ПредметДоговора = ЗНАЧЕНИЕ(Перечисление.уатПредметыДоговоровКонтрагентов.ПустаяСсылка)
	|					ИЛИ ДоговорКонтрагента.ПредметДоговора = &ПредметДоговора)
	|				И (&Сделка = НЕОПРЕДЕЛЕНО
	|					ИЛИ Сделка = &Сделка)
	|				И (НЕ &флОтборПоРЛ
	|					ИЛИ Сделка В (&мсвСделкиРЛ))
	|				И (&ЗаказНаТС = НЕОПРЕДЕЛЕНО
	|					ИЛИ ЗаказНаТС = &ЗаказНаТС)
	|				И (&Представление = 0
	|					ИЛИ ЗаказНаТС <> ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка) И ЗаказНаТС <> НЕОПРЕДЕЛЕНО)) КАК уатРасчетыПоДокументамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРасчетыПоДокументамОбороты.Сделка,
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента,
	|	уатРасчетыПоДокументамОбороты.Валюта,
	|	уатРасчетыПоДокументамОбороты.ПолучательУслуг,
	|	уатРасчетыПоДокументамОбороты.ЭтапОплаты,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРасчетыПоДокументамОбороты.Сделка КАК Сделка,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС КАК ЗаказНаТС,
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(уатРасчетыПоДокументамОбороты.Осталось) КАК Сумма,
	|	СУММА(уатРасчетыПоДокументамОбороты.Всего) КАК Всего,
	|	ВЫБОР
	|		КОГДА уатДатыПлатежей.ДатаПлатежаПредварительная <> ДАТАВРЕМЯ(1, 1, 1)
	|				И уатДатыПлатежей.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА &ПериодичностьДень
	|						ТОГДА уатДатыПлатежей.ДатаПлатежаПредварительная
	|					ИНАЧЕ НАЧАЛОПЕРИОДА(уатДатыПлатежей.ДатаПлатежаПредварительная, МЕСЯЦ)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПериодичностьДень
	|					ТОГДА уатДатыПлатежей.ДатаПлатежа
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(уатДатыПлатежей.ДатаПлатежа, МЕСЯЦ)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДатаПлатежа,
	|	ЕСТЬNULL(уатРасчетыПоДокументамОбороты.ЭтапОплаты.ВариантОтсчета = ЗНАЧЕНИЕ(Перечисление.уатВариантыОтсчетаДатыПлатежа.ДоОтправленияПоЗаказу), ЛОЖЬ) КАК Предоплата,
	|	уатДатыПлатежей.ДатаПлатежаПредварительная <> ДАТАВРЕМЯ(1, 1, 1)
	|		И уатДатыПлатежей.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) КАК ПредварительнаяДатаПлатежа,
	|	СУММА(уатРасчетыПоДокументамОбороты.Осталось) <= 0 КАК ПлатежЗакрыт
	|ПОМЕСТИТЬ втСвернутая
	|ИЗ
	|	уатРасчетыПоДокументамОбороты КАК уатРасчетыПоДокументамОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатДатыПлатежей КАК уатДатыПлатежей
	|		ПО уатРасчетыПоДокументамОбороты.Сделка = уатДатыПлатежей.Сделка
	|			И (уатРасчетыПоДокументамОбороты.ЗаказНаТС = уатДатыПлатежей.ЗаказНаТС 
	|				ИЛИ ((уатРасчетыПоДокументамОбороты.ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|				ИЛИ уатРасчетыПоДокументамОбороты.ЗаказНаТС = НЕОПРЕДЕЛЕНО)
	|			И уатДатыПлатежей.ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)))
	|			И уатРасчетыПоДокументамОбороты.ПолучательУслуг = уатДатыПлатежей.ПолучательУслуг
	|			И уатРасчетыПоДокументамОбороты.ДоговорКонтрагента = уатДатыПлатежей.ДоговорКонтрагента
	|			И уатРасчетыПоДокументамОбороты.ЭтапОплаты = уатДатыПлатежей.ЭтапОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРасчетыПоДокументамОбороты.Сделка,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС,
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента,
	|	уатРасчетыПоДокументамОбороты.ЭтапОплаты,
	|	уатДатыПлатежей.ДатаПлатежа,
	|	уатДатыПлатежей.ДатаПлатежаПредварительная,
	|	ЕСТЬNULL(уатРасчетыПоДокументамОбороты.ЭтапОплаты.ВариантОтсчета = ЗНАЧЕНИЕ(Перечисление.уатВариантыОтсчетаДатыПлатежа.ДоОтправленияПоЗаказу), ЛОЖЬ),
	|	уатРасчетыПоДокументамОбороты.Сделка.Организация,
	|	уатРасчетыПоДокументамОбороты.Сделка.Номер,
	|	уатРасчетыПоДокументамОбороты.Сделка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСвернутая.Сделка КАК Сделка,
	|	втСвернутая.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &Представление = 0
	|			ТОГДА втСвернутая.Сделка.Организация
	|		ИНАЧЕ втСвернутая.ЗаказНаТС.Организация
	|	КОНЕЦ КАК СделкаОрганизация,
	|	ВЫБОР
	|		КОГДА &Представление = 0
	|			ТОГДА втСвернутая.Сделка.Номер
	|		ИНАЧЕ втСвернутая.ЗаказНаТС.Номер
	|	КОНЕЦ КАК СделкаНомер,
	|	ВЫБОР
	|		КОГДА &Представление = 0
	|			ТОГДА втСвернутая.Сделка.Дата
	|		ИНАЧЕ втСвернутая.ЗаказНаТС.Дата
	|	КОНЕЦ КАК СделкаДата,
	|	ВЫБОР
	|		КОГДА втСвернутая.ПлатежЗакрыт
	|			ТОГДА втСвернутая.Всего
	|		ИНАЧЕ втСвернутая.Сумма
	|	КОНЕЦ КАК Сумма,
	|	втСвернутая.ДатаПлатежа КАК ДатаПлатежа,
	|	втСвернутая.Предоплата КАК Предоплата,
	|	втСвернутая.ПредварительнаяДатаПлатежа КАК ПредварительнаяДатаПлатежа,
	|	втСвернутая.ПлатежЗакрыт КАК ПлатежЗакрыт
	|ИЗ
	|	втСвернутая КАК втСвернутая
	|ГДЕ
	|	(&ОтображатьПредварительные
	|			ИЛИ НЕ втСвернутая.ПредварительнаяДатаПлатежа)
	|	И (&ОтображатьЗакрытые
	|			ИЛИ НЕ втСвернутая.ПлатежЗакрыт)");
	Запрос.УстановитьПараметр("Организация",               ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Контрагент",                ?(ЗначениеЗаполнено(Контрагент), Контрагент, Неопределено));
	Запрос.УстановитьПараметр("ЗаказНаТС",                 ?(ЗначениеЗаполнено(ЗаказНаТС), ЗаказНаТС, Неопределено));
	Запрос.УстановитьПараметр("Сделка",                    ?(ЗначениеЗаполнено(Сделка), Сделка, Неопределено));
	Запрос.УстановитьПараметр("Валюта",                    Валюта);
	Запрос.УстановитьПараметр("ВВалютеУпр",                Валюта = ВалютаУпрУчета);
	Запрос.УстановитьПараметр("ПериодичностьДень",         ПериодичностьДень);
	Если ВидЗадолженности = 0 Тогда
		Запрос.УстановитьПараметр("ПолучательУслуг",       Перечисления.уатПолучателиУслуг.Контрагент);
	Иначе
		Запрос.УстановитьПараметр("ПолучательУслуг",       Перечисления.уатПолучателиУслуг.НашаОрганизация);
	КонецЕсли;
	Запрос.УстановитьПараметр("Представление",             Представление);
	Запрос.УстановитьПараметр("ПредметДоговора",           ПредметДоговора);
	Запрос.УстановитьПараметр("ОтображатьПредварительные", ОтображатьПредварительные);
	Запрос.УстановитьПараметр("ОтображатьЗакрытые",        ОтображатьЗакрытые);
	
	мсвПустойЗаказ = Новый Массив;
	мсвПустойЗаказ.Добавить(Неопределено);
	мсвПустойЗаказ.Добавить(Документы.уатЗаказГрузоотправителя.ПустаяСсылка());
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		мсвПустойЗаказ.Добавить(Документы.такАрендаТС.ПустаяСсылка());
		мсвПустойЗаказ.Добавить(Документы.такЗаказТакси.ПустаяСсылка());
	КонецЕсли;
	Запрос.УстановитьПараметр("ПустойЗаказ", мсвПустойЗаказ);
	
	// РЛ нет в ПК, если договор "По счетам", поэтому берем все счета, связанные с этим РЛ
	мсвСделкиРЛ = Новый Массив;
	Если ЗначениеЗаполнено(РемонтныйЛист) Тогда
		мсвСделкиРЛ.Добавить(РемонтныйЛист);
		мсвСчетаНаОплатуРЛ = уатОбщегоНазначения_проф.НайтиСчетаНаОплатуПоставщикаПоРемонтномуЛисту(РемонтныйЛист);
		Для Каждого ТекСчетНаОплату Из мсвСчетаНаОплатуРЛ Цикл
			мсвСделкиРЛ.Добавить(ТекСчетНаОплату);
		КонецЦикла;
	КонецЕсли;
	Запрос.УстановитьПараметр("мсвСделкиРЛ", мсвСделкиРЛ);
	Запрос.УстановитьПараметр("флОтборПоРЛ", ЗначениеЗаполнено(РемонтныйЛист));
	
	// получаем множитель для пересчета из валюты упр. в валюту отчета
	СтруктураКурсаОтчета = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(Валюта, ТекущаяДата());
	СтруктураКурсаУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаУпрУчета, ТекущаяДата());
	Если СтруктураКурсаУпр.Кратность = 0 ИЛИ СтруктураКурсаОтчета.Курс = 0 Тогда
		КоэффициентКурсаУпр = 0;
	Иначе
		КоэффициентКурсаУпр = СтруктураКурсаУпр.Курс / СтруктураКурсаУпр.Кратность * СтруктураКурсаОтчета.Кратность / СтруктураКурсаОтчета.Курс;
	КонецЕсли;
	Запрос.УстановитьПараметр("КоэффициентКурсаУпр", КоэффициентКурсаУпр);
	
	ТаблицаДанные = Запрос.Выполнить().Выгрузить();
	
	// Формируем структуру данных в удобном представлении - соответствие массивов строк по датам платежей
	СтрокиПоДатам = Новый Соответствие;
	СуммыПоДатам = Новый Соответствие;
	СтруктураИтоги = Новый Структура("Сумма, ВхДолг, ИсхДолг", 0, 0, 0);
	Для Каждого ТекСтрока Из ТаблицаДанные Цикл
		мсвСтрокиДанных = СтрокиПоДатам.Получить(ТекСтрока.ДатаПлатежа);
		Если мсвСтрокиДанных = Неопределено Тогда
			мсвСтрокиДанных = Новый Массив;
		КонецЕсли;
		мсвСтрокиДанных.Добавить(ТекСтрока);
		СтрокиПоДатам.Вставить(ТекСтрока.ДатаПлатежа, мсвСтрокиДанных);
		
		Если ТекСтрока.ПлатежЗакрыт Тогда // закрытые платежи не включаются в итоговые суммы
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.ДатаПлатежа < ДатаНач Тогда
			СтруктураИтоги.ВхДолг = СтруктураИтоги.ВхДолг + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ДатаПлатежа > ДатаКон Тогда
			СтруктураИтоги.ИсхДолг = СтруктураИтоги.ИсхДолг + ТекСтрока.Сумма;
		Иначе
			СтруктураИтоги.Сумма = СтруктураИтоги.Сумма + ТекСтрока.Сумма;
		КонецЕсли;
		
		ТекЗнач = СуммыПоДатам.Получить(ТекСтрока.ДатаПлатежа);
		Если ТекЗнач = Неопределено Тогда
			ТекЗнач = 0;
		КонецЕсли;
		СуммыПоДатам.Вставить(ТекСтрока.ДатаПлатежа, ТекЗнач + ТекСтрока.Сумма);
	КонецЦикла;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|Колонка");
	ОбластьЗаголовок.Параметры.Заголовок = СтрШаблон("Платежный календарь %1 задолженности с %2 по %3",
		?(ВидЗадолженности = 0, "дебиторской", "кредиторской"),
		Формат(ДатаНач, "ДФ=dd.MM.yyyy"),
		Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	ТабДок.Вывести(ОбластьЗаголовок);
		
	ОбластьШапкаДата = Макет.ПолучитьОбласть("Шапка|Колонка");
	ОбластьЯчейка = Макет.ПолучитьОбласть("Строка|Колонка");
	ОбластьИтогиДата = Макет.ПолучитьОбласть("ОбщиеИтоги|Колонка");
	ОбластьШапкаДатаВнеПериода = Макет.ПолучитьОбласть("Шапка|КолонкаВнеПериода");
	ОбластьЯчейкаВнеПериода = Макет.ПолучитьОбласть("Строка|КолонкаВнеПериода");
	ОбластьИтогиДатаВнеПериода = Макет.ПолучитьОбласть("ОбщиеИтоги|КолонкаВнеПериода");
	ОбластьШапкаИтогиЗаНеделю = Макет.ПолучитьОбласть("Шапка|ИтогоЗаНеделю");
	ОбластьЯчейкаИтогиЗаНеделю = Макет.ПолучитьОбласть("Строка|ИтогоЗаНеделю");
	ОбластьИтогиДатаИтогиЗаНеделю = Макет.ПолучитьОбласть("ОбщиеИтоги|ИтогоЗаНеделю");
	
	ЦветТекстПоУмолчанию = WebЦвета.Черный;
	
	Если ПериодичностьДень Тогда
		НачалоПериодаОтображения = НачалоНедели(ДатаНач);
		КонецПериодаОтображения = НачалоДня(КонецНедели(ДатаКон));
		КоличПоВертикали = ((КонецПериодаОтображения - НачалоПериодаОтображения)/24/3600 + 1)/7;
	Иначе
		НачалоПериодаОтображения = НачалоПолугодияДоп(ДатаНач);
		КонецПериодаОтображения = КонецПолугодияДоп(ДатаКон);
		КоличПоВертикали = (Месяц(КонецПериодаОтображения) - Месяц(НачалоПериодаОтображения) + 1)/6 + (Год(ДатаКон) - Год(ДатаНач))*2;
		ОбластьШапкаДата.Область().Формат = "ДФ='MMMM yyyy'";
		ОбластьШапкаДатаВнеПериода.Область().Формат = "ДФ='MMMM yyyy'";
	КонецЕсли;
		
	Для НомПоВертикали = 1 По КоличПоВертикали Цикл
		// шапка таблицы
		Для НомКолонки = 1 По КоличПоГоризонтали Цикл
			ТекДата = РассчитатьТекДату(ПериодичностьДень, КоличПоГоризонтали, НачалоПериодаОтображения, НомПоВертикали, НомКолонки);
			
			флТекДатаВПериоде = (ТекДата >= ДатаНач И ТекДата <= ДатаКон);
			
			ТекОбласть = ?(флТекДатаВПериоде, ОбластьШапкаДата, ОбластьШапкаДатаВнеПериода);
			ТекОбласть.Параметры.Дата = ТекДата;
			Если НомКолонки = 1 Тогда
				ТабДок.Вывести(ТекОбласть);
			Иначе
				Если флТекДатаВПериоде Тогда
					ТекОбласть.Область().ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				Иначе
					ТекОбласть.Область().ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				КонецЕсли;
				ТабДок.Присоединить(ТекОбласть);
			КонецЕсли;
		КонецЦикла;
		
		// итоги за неделю
		ТабДок.Присоединить(ОбластьШапкаИтогиЗаНеделю);
		
		// расчет количества выводимых строк документов в день
		СтрокДокументовЗаДень = СтрокДокументовЗаДеньМинимум;
		Для НомКолонки = 1 По КоличПоГоризонтали Цикл
			ТекДата = РассчитатьТекДату(ПериодичностьДень, КоличПоГоризонтали, НачалоПериодаОтображения, НомПоВертикали, НомКолонки);
			
			мсвСтрокиДанные = СтрокиПоДатам.Получить(ТекДата);
			Если мсвСтрокиДанные = Неопределено Тогда
				КоличДокументов = 0;
			Иначе
				КоличДокументов = мсвСтрокиДанные.Количество();
			КонецЕсли;
			СтрокДокументовЗаДень = Макс(КоличДокументов, СтрокДокументовЗаДень);
		КонецЦикла;
		
		// строки документов		
		Для НомСтроки = 1 По СтрокДокументовЗаДень Цикл
			Для НомКолонки = 1 По КоличПоГоризонтали Цикл
				ТекДата = РассчитатьТекДату(ПериодичностьДень, КоличПоГоризонтали, НачалоПериодаОтображения, НомПоВертикали, НомКолонки);
				
				флТекДатаВПериоде = (ТекДата >= ДатаНач И ТекДата <= ДатаКон);
				
				// сброс данных области ячейки
				ТекОбласть = ?(флТекДатаВПериоде, ОбластьЯчейка, ОбластьЯчейкаВнеПериода);
				ЗаполнитьЗначенияСвойств(ТекОбласть.Параметры, Новый Структура("СделкаПредставление, СделкаРасшифровка, Сумма", "", Неопределено, 0));
				
				мсвСтрокиДанные = СтрокиПоДатам.Получить(ТекДата);
				Если мсвСтрокиДанные <> Неопределено Тогда
					КоличДокументов = мсвСтрокиДанные.Количество();
					Если НомСтроки <= КоличДокументов Тогда
						СтрокаДанные = мсвСтрокиДанные[НомСтроки-1];
						ЗаполнитьЗначенияСвойств(ТекОбласть.Параметры, СтрокаДанные);
						СтруктураСделка = Новый Структура("Номер, Организация", СтрокаДанные.СделкаНомер, СтрокаДанные.СделкаОрганизация);
						СделкаПредставление = СтрокаДанные.СделкаНомер;
						СделкаРасшифровка = Новый Структура("Сделка, Договор", СтрокаДанные.Сделка, СтрокаДанные.ДоговорКонтрагента);
						ЗаполнитьЗначенияСвойств(ТекОбласть.Параметры, Новый Структура("СделкаПредставление, СделкаРасшифровка", СделкаПредставление, СделкаРасшифровка));
						
						Если флТекДатаВПериоде Тогда
							Если СтрокаДанные.ПлатежЗакрыт Тогда
								Если СтрокаДанные.Предоплата Тогда
									ТекОбласть.Область().ЦветТекста = WebЦвета.Голубой; // закрытый платеж-предоплата - светло-синим цветом
								Иначе
									ТекОбласть.Область().ЦветТекста = WebЦвета.СветлоСерый; // закрытый платеж серым цветом
								КонецЕсли;
							ИначеЕсли СтрокаДанные.ПредварительнаяДатаПлатежа Тогда
								ТекОбласть.Область().ЦветТекста = WebЦвета.Зеленый; // предварительная зеленым цветом
							ИначеЕсли СтрокаДанные.Предоплата Тогда
								ТекОбласть.Область().ЦветТекста = WebЦвета.Синий; // предоплата синим цветом
							Иначе
								ТекОбласть.Область().ЦветТекста = ЦветТекстПоУмолчанию;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если НомКолонки = 1 Тогда
					ТабДок.Вывести(ТекОбласть);
				Иначе
					Если флТекДатаВПериоде Тогда
						ТекОбласть.Область().ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
					Иначе
						ТекОбласть.Область().ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
					КонецЕсли;
					ТабДок.Присоединить(ТекОбласть);
				КонецЕсли;
			КонецЦикла;
			
			// итоги за неделю
			ТекОбластьИтоги = ТабДок.Присоединить(ОбластьЯчейкаИтогиЗаНеделю);
		КонецЦикла;
				
		// итоговая строка таблицы
		ИтогоЗаНеделю = 0;
		Для НомКолонки = 1 По КоличПоГоризонтали Цикл
			ТекДата = РассчитатьТекДату(ПериодичностьДень, КоличПоГоризонтали, НачалоПериодаОтображения, НомПоВертикали, НомКолонки);
			
			флТекДатаВПериоде = (ТекДата >= ДатаНач И ТекДата <= ДатаКон);
			
			// сброс данных области ячейки
			ТекОбласть = ?(ТекДата >= ДатаНач И ТекДата <= ДатаКон, ОбластьИтогиДата, ОбластьИтогиДатаВнеПериода);
			ЗаполнитьЗначенияСвойств(ТекОбласть.Параметры,
				Новый Структура("СделкаПредставление, СделкаРасшифровка, Сумма, ТекстИтого", "", Неопределено, 0, ""));
			
			ИтогиПоДате = СуммыПоДатам.Получить(ТекДата);
			Если ИтогиПоДате = Неопределено Тогда
				ИтогиПоДате = 0;
			КонецЕсли;
			
			ТекОбласть.Параметры.Сумма = ИтогиПоДате;
			
			Если НомКолонки = 1 Тогда
				//ТекОбласть.Параметры.ТекстИтого = "ИТОГО";
				ТабДок.Вывести(ТекОбласть);
			Иначе
				Если флТекДатаВПериоде Тогда
					ТекОбласть.Область().ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				Иначе
					ТекОбласть.Область().ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				КонецЕсли;
				ТабДок.Присоединить(ТекОбласть);
			КонецЕсли;
			
			Если флТекДатаВПериоде Тогда
				ИтогоЗаНеделю = ИтогоЗаНеделю + ИтогиПоДате;
			КонецЕсли;
		КонецЦикла;
		
		// итоги за неделю
		ОбластьИтогиДатаИтогиЗаНеделю.Параметры.Сумма = ИтогоЗаНеделю;
		ТабДок.Присоединить(ОбластьИтогиДатаИтогиЗаНеделю);
		
		// пустой промежуток между днями по вертикали
		ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДок.Вывести(ОбластьПустаяСтрока);
	КонецЦикла;
	
	//подвал
	ТекОбласть = Макет.ПолучитьОбласть("Подвал|ИтогоЗаНеделю");
	ТабДок.Вывести(ТекОбласть);
	Если Периодичность = Перечисления.Периодичность.День Тогда
		ТекОбласть = Макет.ПолучитьОбласть("Подвал|ИтогоЗаНеделю");
		ТабДок.Присоединить(ТекОбласть);
	КонецЕсли;
	
	ТекОбласть = Макет.ПолучитьОбласть("Подвал|КолонкаИтоги");
	ТекОбласть.Параметры.ИтогоПодвалТекст = "Входящий долг:";
	ТекОбласть.Параметры.ИтогоПодвал = СтруктураИтоги.ВхДолг;
	ТабДок.Присоединить(ТекОбласть);
	ТекОбласть = Макет.ПолучитьОбласть("Подвал|КолонкаИтоги");
	ТекОбласть.Параметры.ИтогоПодвалТекст = "Исходящий долг:";
	ТекОбласть.Параметры.ИтогоПодвал = СтруктураИтоги.ИсхДолг;
	ТабДок.Присоединить(ТекОбласть);
	ТекОбласть = Макет.ПолучитьОбласть("Подвал|КолонкаИтоги");
	ТекОбласть.Параметры.ИтогоПодвалТекст = "За период:";
	ТекОбласть.Параметры.ИтогоПодвал = СтруктураИтоги.Сумма;
	ТабДок.Присоединить(ТекОбласть);
	
	//// Зафиксируем заголовок отчета
	//ТабДок.ФиксацияСверху 	= 6;
	//ТабДок.ПолеСлева 		= 0;
	//ТабДок.ПолеСправа 		= 0;

КонецПроцедуры

&НаСервере
Функция НачалоПолугодияДоп(ТекДата)
	Если Месяц(ТекДата) <=6 Тогда
		Возврат НачалоГода(ТекДата);
	Иначе
		Возврат Дата(Год(ТекДата), 7, 1);
	КонецЕсли;
КонецФункции

&НаСервере
Функция КонецПолугодияДоп(ТекДата)
	Если Месяц(ТекДата) >=7 Тогда
		Возврат КонецГода(ТекДата);
	Иначе
		Возврат Дата(Год(ТекДата), 6, 30);
	КонецЕсли;
КонецФункции

&НаСервере
Функция РассчитатьТекДату(ПериодичностьДень, КоличПоГоризонтали, НачалоПериодаОтображения, НомПоВертикали, НомКолонки)
	Если ПериодичностьДень Тогда
		ТекДата = НачалоПериодаОтображения + ((НомПоВертикали-1)*КоличПоГоризонтали + НомКолонки - 1)*24*3600;
	Иначе
		ТекДата = ДобавитьМесяц(НачалоПериодаОтображения, ((НомПоВертикали-1)*КоличПоГоризонтали + НомКолонки - 1));
	КонецЕсли;
	
	Возврат ТекДата;
КонецФункции		
			
#КонецОбласти
